<?php

require("../../../bootstrap.php");

$response = array(
    "code" => 0,
    "data" => array(
        "pv" => array(
            "daily" => 0,
            "data" => array(
                "date" => [
                    "05-25",
                    "05-26",
                    "05-27",
                    "05-28",
                    "05-29",
                    "05-30"
                ],
                "value" => [
                    0,
                    0,
                    0,
                    0,
                    0,
                    0
                ]
            ),
            "total" => 0,
            "yesterday" => 0
        ),
        "origin_analysis" => array(
            "total" => 11,
            "order_rate" => ["30%", "30%", "30%", "30%", "30%", "30%", "30%", "30%", "30%", "30%"],
            "uv_rate" => ["30%", "30%", "30%", "30%", "30%", "30%", "30%", "30%", "30%", "30%", "30%"],
            "origin" => ["跟谁学网站", '260', '百度', '260', '百度', '260', '百度','260', '百度', '百度', '百度'],
            "value" => [20, 29, 29, 29, 23, 32, 32, 43, 43 ,43]
        )
    )
);

echo json_encode($response);


