<?php

require("../bootstrap.php");

render(
    "orgRoom/blackboard",
    array(
        'code' => 0,
        'tpl_data' => array(
            'abtest' => 1,
            'is_favored' => true,
            'base_info' => array(
                'id' => '329016489',
                'name' => '北大1',
                'avatar' => 'http://test-img.gsxservice.com/17159_bkc4jcbu.jpg',
                'number' => '329016489',
                'mobile' => '010-1101101',
                'score' => '4.7',
                'location' => '北京',
                'comments_cnt' => '34',
                'brief' => '一句话简介',
                'tags' => array(
                    '0' => array(
                        'name' => 'kobe',
                    ),
                    '1' => array(
                        'name' => 'nba',
                    ),
                    '2' => array(
                        'name' => '单挑贝尔',
                    )
                ),
                'domain' => 'liumeiyu03',
                'count' => 20,
                'page' => 2,
                'page_size' => 1
            ),
            'black_list' => array(
                array(
                    "id" => "8053",
                    "storage_id" => "376595",
                    "type" => "1",
                    "title" => "二建VIP课程建筑实务开课了报名就送教材",
                    "create_time" => "2015-10-28 18:08:40",
                    "content" => "<p>&nbsp; &nbsp; 时间的推移，总是会给人留有太多的回忆，建造师课程的学习，总会给每一个建筑施工人员带来无限的乐趣和回忆。好多人都是觉得二建的学习是痛苦的，但是来到我们宏图职业教育之后学习为什么会变得简单和有趣呢？不仅仅是我们这边的老师带给同学们学习的方法和快捷记忆方式，还有一大帮一起学习的同学，相互交流、学习、进步，学习的快乐不会仅仅止步于学习本身、还会来源于同学之间的交流和与老师之间的交流。我们所建立的社群不仅仅局限于学习交流，会有很多建工行业的过来人给你经验、让你感受到行业的乐趣和树立信心做好自己的工作，做好自己的职业生涯规划。</p><p>&nbsp; &nbsp;面授课、课件、网络课、录播课、1v1课程等等，我们用独特的直播形式来聚集我们的老师和同学，感受到学习乐趣的同时，一次性考过二建，独享挂靠费的同时，还会忘不了和我们的学员一起分享成功的快乐。全程的直播和课后的录播相结合，让学习有约束的同时又可以没有约束，随时随地，想学就学、想问就问。</p><p>&nbsp; &nbsp;通过率或许是同学们关心的一个问题，网上往往会看到高通过率保过的班型，收费不菲不说，还不能真正的保证学员通过。屌丝的时代，我们需要逆袭，我们需要高质量、高通过率、低价格的课程来完成我们的梦想，宏图职业教育给了你课程，你就得懂得珍惜，不要错过这次机会。</p><p>&nbsp; &nbsp;免费的课程学不到自己想要的东西，收费的课程却又想课程的价格有点高，量身为广大建筑施工人员定制的2016年二级建造师VIP通关班（http://www.genshuixue.com/teacher/classCourseDetail/150710819590），的确集优质、精品、低廉、高效为一体的课程最终还是深受学员的喜爱的。</p><p>&nbsp; &nbsp;最后，有个小小的活动还是要告诉大家的：</p><p>&nbsp; &nbsp;1.截止今晚23:59报名的学员可以免费享受二级建造师在线题库。</p><p>&nbsp; &nbsp;2.推荐学员报名的同学，可以享受100元现金大奖。</p><p>&nbsp; &nbsp;3.转发此消息的学员可以独自享受红包。</p><p>&nbsp; &nbsp;4.报名即可免费赠送教材。</p><p><span style=\"line-height: 24.060152053833px;\">点此链接期待您的加入http://www.genshuixue.com/teacher/classCourseDetail/150710819590</span></p>",
                    "img" => "http://img.gsxservice.com/3825184_ep3tg5fs.jpg"
                ),
                array(
                    "id" => "8053",
                    "storage_id" => "376595",
                    "type" => "1",
                    "title" => "二建VIP课程建筑实务开课了报名就送教材",
                    "create_time" => "2015-10-28 18:08:40",
                    "content" => "<p>&nbsp; &nbsp; 时间的推移，总是会给人留有太多的回忆，建造师课程的学习，总会给每一个建筑施工人员带来无限的乐趣和回忆。好多人都是觉得二建的学习是痛苦的，但是来到我们宏图职业教育之后学习为什么会变得简单和有趣呢？不仅仅是我们这边的老师带给同学们学习的方法和快捷记忆方式，还有一大帮一起学习的同学，相互交流、学习、进步，学习的快乐不会仅仅止步于学习本身、还会来源于同学之间的交流和与老师之间的交流。我们所建立的社群不仅仅局限于学习交流，会有很多建工行业的过来人给你经验、让你感受到行业的乐趣和树立信心做好自己的工作，做好自己的职业生涯规划。</p><p>&nbsp; &nbsp;面授课、课件、网络课、录播课、1v1课程等等，我们用独特的直播形式来聚集我们的老师和同学，感受到学习乐趣的同时，一次性考过二建，独享挂靠费的同时，还会忘不了和我们的学员一起分享成功的快乐。全程的直播和课后的录播相结合，让学习有约束的同时又可以没有约束，随时随地，想学就学、想问就问。</p><p>&nbsp; &nbsp;通过率或许是同学们关心的一个问题，网上往往会看到高通过率保过的班型，收费不菲不说，还不能真正的保证学员通过。屌丝的时代，我们需要逆袭，我们需要高质量、高通过率、低价格的课程来完成我们的梦想，宏图职业教育给了你课程，你就得懂得珍惜，不要错过这次机会。</p><p>&nbsp; &nbsp;免费的课程学不到自己想要的东西，收费的课程却又想课程的价格有点高，量身为广大建筑施工人员定制的2016年二级建造师VIP通关班（http://www.genshuixue.com/teacher/classCourseDetail/150710819590），的确集优质、精品、低廉、高效为一体的课程最终还是深受学员的喜爱的。</p><p>&nbsp; &nbsp;最后，有个小小的活动还是要告诉大家的：</p><p>&nbsp; &nbsp;1.截止今晚23:59报名的学员可以免费享受二级建造师在线题库。</p><p>&nbsp; &nbsp;2.推荐学员报名的同学，可以享受100元现金大奖。</p><p>&nbsp; &nbsp;3.转发此消息的学员可以独自享受红包。</p><p>&nbsp; &nbsp;4.报名即可免费赠送教材。</p><p><span style=\"line-height: 24.060152053833px;\">点此链接期待您的加入http://www.genshuixue.com/teacher/classCourseDetail/150710819590</span></p>",
                    "img" => "http://img.gsxservice.com/3825184_ep3tg5fs.jpg"
                ),
                array(
                    "id" => "8053",
                    "storage_id" => "376595",
                    "type" => "1",
                    "title" => "二建VIP课程建筑实务开课了报名就送教材",
                    "create_time" => "2015-10-28 18:08:40",
                    "content" => "<p>&nbsp; &nbsp; 时间的推移，总是会给人留有太多的回忆，建造师课程的学习，总会给每一个建筑施工人员带来无限的乐趣和回忆。好多人都是觉得二建的学习是痛苦的，但是来到我们宏图职业教育之后学习为什么会变得简单和有趣呢？不仅仅是我们这边的老师带给同学们学习的方法和快捷记忆方式，还有一大帮一起学习的同学，相互交流、学习、进步，学习的快乐不会仅仅止步于学习本身、还会来源于同学之间的交流和与老师之间的交流。我们所建立的社群不仅仅局限于学习交流，会有很多建工行业的过来人给你经验、让你感受到行业的乐趣和树立信心做好自己的工作，做好自己的职业生涯规划。</p><p>&nbsp; &nbsp;面授课、课件、网络课、录播课、1v1课程等等，我们用独特的直播形式来聚集我们的老师和同学，感受到学习乐趣的同时，一次性考过二建，独享挂靠费的同时，还会忘不了和我们的学员一起分享成功的快乐。全程的直播和课后的录播相结合，让学习有约束的同时又可以没有约束，随时随地，想学就学、想问就问。</p><p>&nbsp; &nbsp;通过率或许是同学们关心的一个问题，网上往往会看到高通过率保过的班型，收费不菲不说，还不能真正的保证学员通过。屌丝的时代，我们需要逆袭，我们需要高质量、高通过率、低价格的课程来完成我们的梦想，宏图职业教育给了你课程，你就得懂得珍惜，不要错过这次机会。</p><p>&nbsp; &nbsp;免费的课程学不到自己想要的东西，收费的课程却又想课程的价格有点高，量身为广大建筑施工人员定制的2016年二级建造师VIP通关班（http://www.genshuixue.com/teacher/classCourseDetail/150710819590），的确集优质、精品、低廉、高效为一体的课程最终还是深受学员的喜爱的。</p><p>&nbsp; &nbsp;最后，有个小小的活动还是要告诉大家的：</p><p>&nbsp; &nbsp;1.截止今晚23:59报名的学员可以免费享受二级建造师在线题库。</p><p>&nbsp; &nbsp;2.推荐学员报名的同学，可以享受100元现金大奖。</p><p>&nbsp; &nbsp;3.转发此消息的学员可以独自享受红包。</p><p>&nbsp; &nbsp;4.报名即可免费赠送教材。</p><p><span style=\"line-height: 24.060152053833px;\">点此链接期待您的加入http://www.genshuixue.com/teacher/classCourseDetail/150710819590</span></p>",
                    "img" => "http://img.gsxservice.com/3825184_ep3tg5fs.jpg"
                )
            ),
            'coupon' => array(
                '0' => array(
                    'id' => "705491276b540ecfa6976a31c3b071e3",
                    'total_money' => "100.00",
                    'cond_threshold' => null,
                    'url' => "/org/orgCoupon?serial_num=705491276b540ecfa6976a31c3b071e3",
                ),
                '1' => array(
                    'id' => "ce1c859e272475dd54dff64253663fdc",
                    'total_money' => "20.00",
                    'cond_threshold' => 100.00,
                    'url' => "/org/orgCoupon?serial_num=705491276b540ecfa6976a31c3b071e3",
                ),
            ),
            "title" => "北京 徐梅山-星座-居家风水-找好老师，上跟谁学",
            "description" => "【找好老师，上跟谁学】因为专业所以权威，深入浅出、简单易懂、化繁为简、结合实际、实例分析，教授科目：星座-居家风水",
            "keywords" => "北京 徐梅山-星座",
            "crumb" => array( // 面包屑
                array(
                    "name" => "跟谁学北京站",
                    "url" => "http://test.genshuixue.com"
                ),
                array(
                    "name" => "北京艺术",
                    "url" => "http://test.genshuixue.com/so--975.html"
                ),
                array(
                    "name" => "北京器乐",
                    "url" => "http://test.genshuixue.com/so--975_976.html"
                ),
                array(
                    "name" => "北京古筝",
                    "url" => "http://test.genshuixue.com/so--975_976_979.html"
                ),
                array(
                    "name" => "智π国际",
                    "url" => "http://yanbin-www.test.genshuixue.com/i/331801619"
                ),
                array(
                    "name" => "黑板报",
                    "url" => "#"
                )
            ),
            "crumb_related" => array( // 面包屑 － 相关课程
                array(
                    "id" => "1167",
                    "name" => "低音提琴",
                    "level" => "3",
                    "parent_id" => "976"
                ),
                array(
                    "id" => "979",
                    "name" => "古筝",
                    "level" => "3",
                    "parent_id" => "976"
                ),
                array(
                    "id" => "996",
                    "name" => "爵士鼓",
                    "level" => "3",
                    "parent_id" => "976"
                ),
                array(
                    "id" => "1166",
                    "name" => "大号",
                    "level" => "3",
                    "parent_id" => "976"
                ),
                array(
                    "id" => "1005",
                    "name" => "手鼓",
                    "level" => "3",
                    "parent_id" => "976"
                ),
                array(
                    "id" => "978",
                    "name" => "吉他",
                    "level" => "3",
                    "parent_id" => "976"
                )
            )
        )
    )
);