const config = [
    {
        key: 1,
        title: '线上教学',
        content: '采用直播和视频的线上教学方式，讲练测多维结合，还原真实上课场景。授课内容与课程互动相结合，全面提升学习效果。'
    },
    {
        key: 2,
        title: '纸质讲义',
        content: '课程标配纸质讲义，结合课程进度编排，全面配套课程学习。'
    },
    {
        key: 4,
        title: '一年回放',
        content: '课程有效期内，您可以通过网站、手机随时多次观看回放。其中直播课节上完后2小时内，即可生成回放。'
    },
    {
        key: 512,
        title: '两年回放',
        content: '课程有效期内，您可以通过网站、手机随时多次观看回放。其中直播课节上完后2小时内，即可生成回放。'
    },
    {
        key: 1024,
        title: '三年回放',
        content: '课程有效期内，您可以通过网站、手机随时多次观看回放。其中直播课节上完后2小时内，即可生成回放。'
    },
    {
        key: 8,
        title: '作业批改',
        content: '每讲课程均设置有课程作业，辅导老师手工批改，并对每位学员学习情况进行跟踪和讲解。为学习有效性保驾护航。'
    },
    {
        key: 16,
        title: '及时答疑',
        content: '以学员为中心，真正保证每个学员的学习效果。采用小班教学方式，每个小班级均有辅导老师进行专门辅导，确保每个学员都能受到老师关注。'
    },
    {
        key: 32,
        title: '学习报告',
        content: '根据出勤、测评等数据提供的学习数据报告及相应分析，深度剖析学员的学习效果，并给出针对性的提升建议。'
    },
    {
        key: 64,
        title: '课前测试',
        content: '课前水平测试，根据测试结果选择对应体系化课程的等级。保证每个学员的课程接受度和吸收效果。'
    },
    {
        key: 128,
        title: '考试检测',
        content: '设置考试检测。帮助学员适应考试环境，并可在考试中查漏补缺，专项提升。'
    },
    {
        key: 256,
        title: '学期家长会',
        content: '配合测试成绩，辅导老师召开班级家长会，将班内学员的情况和努力方向传递给家长。只要老师、家长、学员拧成一股，拿高分不是梦。'
    }
];

export default config;
