const config = {
    TIPS: [
        {
            name: '如何查看已购课程？',
            tooltip: '请使用购课账号登录官网或者APP，官网请在【我的课程】，APP请进入【学习中心】，查看已购课程并学习。'
        },
        {
            name: '错过课程直播怎么办？',
            tooltip: '除特殊课程外，所有课程均提供回放。回放可在直播结束后2小时内开放。'
        },
        {
            name: '无法登录怎么办？',
            tooltip: '请确认您的网络环境无误，PC登录建议使用谷歌浏览器；APP请确认当前使用的是最新版本。'
        },
        {
            name: '如何用手机听课？',
            tooltip: '下载跟谁学APP，进入学习中心，即可使用手机听课。'
        },
        {
            name: '课程过期了怎么办？',
            tooltip: '课程过期将无法观看，请在有效期内抓紧时间观看哦~'
        },
    ]
};
export default config;
