<?php

/**
 * 一级分类
 *
 * @type {Array}
 */
$category1 = array(
    array(
        "name" => "孕婴教育",
        "id" => "675",
    ) ,
    array(
        "name" => "学前教育",
        "id" => "33554432",
    ) ,
    array(
        "name" => "小学",
        "id" => "50331648",
    ) ,
    array(
        "name" => "初中",
        "id" => "67108864",
    ) ,
    array(
        "name" => "高中",
        "id" => "83886080",
    ) ,
    array(
        "name" => "高等教育",
        "id" => "100663296",
    ) ,
    array(
        "name" => "艺术",
        "id" => "150994944",
    ) ,
    array(
        "name" => "体育",
        "id" => "167772160",
    ) ,
    array(
        "name" => "生活技能",
        "id" => "184549376",
    ) ,
    array(
        "name" => "其它",
        "id" => "201326592",
    ) ,
);

/**
 * 二级分类
 *
 * @type {Object}
 */
$category2 = array(
    "16777216" => array(
        array(
            "name" => "孕前",
            "id" => "16842752",
        ) ,
        array(
            "name" => "孕期",
            "id" => "16908288",
        ) ,
        array(
            "name" => "婴儿期",
            "id" => "16973824",
        ) ,
    ) ,
    "33554432" => array(
        array(
            "name" => "早教",
            "id" => "33619968",
        ) ,
        array(
            "name" => "幼儿园小班",
            "id" => "33685504",
        ) ,
        array(
            "name" => "幼儿园中班",
            "id" => "33751040",
        ) ,
        array(
            "name" => "幼儿园大班",
            "id" => "33816576",
        ) ,
        array(
            "name" => "幼小衔接",
            "id" => "33882112",
        ) ,
    ) ,
    "50331648" => array(
        array(
            "name" => "小学一年级",
            "id" => "50397184",
        ) ,
        array(
            "name" => "小学二年级",
            "id" => "50462720",
        ) ,
        array(
            "name" => "小学三年级",
            "id" => "50528256",
        ) ,
        array(
            "name" => "小学四年级",
            "id" => "50593792",
        ) ,
        array(
            "name" => "小学五年级",
            "id" => "50659328",
        ) ,
        array(
            "name" => "小学六年级",
            "id" => "50724864",
        ) ,
        array(
            "name" => "小升初",
            "id" => "50790400",
        ) ,
    ) ,
    "67108864" => array(
        array(
            "name" => "初一",
            "id" => "67174400",
        ) ,
        array(
            "name" => "初二",
            "id" => "67239936",
        ) ,
        array(
            "name" => "初三",
            "id" => "67305472",
        ) ,
        array(
            "name" => "中考",
            "id" => "67371008",
        ) ,
    ) ,
    "83886080" => array(
        array(
            "name" => "高一",
            "id" => "83951616",
        ) ,
        array(
            "name" => "高二文科",
            "id" => "84017152",
        ) ,
        array(
            "name" => "高二理科",
            "id" => "84082688",
        ) ,
        array(
            "name" => "高三文科",
            "id" => "84148224",
        ) ,
        array(
            "name" => "高三理科",
            "id" => "84213760",
        ) ,
        array(
            "name" => "高考",
            "id" => "84279296",
        ) ,
    ) ,
    "100663296" => array(
        array(
            "name" => "大学",
            "id" => "100728832",
        ) ,
        array(
            "name" => "研究生",
            "id" => "100794368",
        ) ,
    ) ,
    "150994944" => array(
        array(
            "name" => "音乐",
            "id" => "151060480",
        ) ,
        array(
            "name" => "舞蹈",
            "id" => "151126016",
        ) ,
        array(
            "name" => "雕塑",
            "id" => "151191552",
        ) ,
        array(
            "name" => "绘画",
            "id" => "151257088",
        ) ,
        array(
            "name" => "书法",
            "id" => "151322624",
        ) ,
        array(
            "name" => "鉴赏",
            "id" => "151388160",
        ) ,
        array(
            "name" => "其他",
            "id" => "151453696",
        ) ,
    ) ,
    "167772160" => array(
        array(
            "name" => "其他",
            "id" => "168230912",
        ) ,
    ) ,
    "184549376" => array(
        array(
            "name" => "其他",
            "id" => "184811520",
        ) ,
    ) ,
    "201326592" => array(
        array(
            "name" => "其他",
            "id" => "201392128",
        ) ,
    ) ,
);

/**
 * 三级分类
 *
 * @type {Object}
 */
$category3 = array(
    "16842752" => array(
        array(
            "name" => "其他",
            "id" => "16844032",
        ) ,
    ) ,
    "16908288" => array(
        array(
            "name" => "其他",
            "id" => "16910592",
        ) ,
    ) ,
    "16973824" => array(
        array(
            "name" => "其他",
            "id" => "16975616",
        ) ,
    ) ,
    "33619968" => array(
        array(
            "name" => "益智",
            "id" => "33620224",
        ) ,
        array(
            "name" => "潜能开发",
            "id" => "33620480",
        ) ,
        array(
            "name" => "感统训练",
            "id" => "33620736",
        ) ,
        array(
            "name" => "亲子",
            "id" => "33620992",
        ) ,
        array(
            "name" => "启蒙",
            "id" => "33621248",
        ) ,
        array(
            "name" => "才艺",
            "id" => "33621504",
        ) ,
        array(
            "name" => "其他",
            "id" => "33621760",
        ) ,
    ) ,
    "33685504" => array(
        array(
            "name" => "语言",
            "id" => "33685760",
        ) ,
        array(
            "name" => "数学",
            "id" => "33686016",
        ) ,
        array(
            "name" => "英语",
            "id" => "33686272",
        ) ,
        array(
            "name" => "艺术",
            "id" => "33686528",
        ) ,
        array(
            "name" => "科学",
            "id" => "33686784",
        ) ,
        array(
            "name" => "社会教育",
            "id" => "33687040",
        ) ,
        array(
            "name" => "健康",
            "id" => "33687296",
        ) ,
        array(
            "name" => "体育",
            "id" => "33687552",
        ) ,
        array(
            "name" => "创意",
            "id" => "33687808",
        ) ,
        array(
            "name" => "多元智能",
            "id" => "33688064",
        ) ,
        array(
            "name" => "手工",
            "id" => "33688576",
        ) ,
        array(
            "name" => "其他",
            "id" => "33688832",
        ) ,
    ) ,
    "33751040" => array(
        array(
            "name" => "语言",
            "id" => "33751296",
        ) ,
        array(
            "name" => "数学",
            "id" => "33751552",
        ) ,
        array(
            "name" => "英语",
            "id" => "33751808",
        ) ,
        array(
            "name" => "艺术",
            "id" => "33752064",
        ) ,
        array(
            "name" => "科学",
            "id" => "33752320",
        ) ,
        array(
            "name" => "社会教育",
            "id" => "33752576",
        ) ,
        array(
            "name" => "健康",
            "id" => "33752832",
        ) ,
        array(
            "name" => "体育",
            "id" => "33753088",
        ) ,
        array(
            "name" => "创意",
            "id" => "33753344",
        ) ,
        array(
            "name" => "多元智能",
            "id" => "33753600",
        ) ,
        array(
            "name" => "手工",
            "id" => "33754112",
        ) ,
        array(
            "name" => "其他",
            "id" => "33754368",
        ) ,
    ) ,
    "33816576" => array(
        array(
            "name" => "语言",
            "id" => "33816832",
        ) ,
        array(
            "name" => "数学",
            "id" => "33817088",
        ) ,
        array(
            "name" => "英语",
            "id" => "33817344",
        ) ,
        array(
            "name" => "艺术",
            "id" => "33817600",
        ) ,
        array(
            "name" => "科学",
            "id" => "33817856",
        ) ,
        array(
            "name" => "社会教育",
            "id" => "33818112",
        ) ,
        array(
            "name" => "健康",
            "id" => "33818368",
        ) ,
        array(
            "name" => "体育",
            "id" => "33818624",
        ) ,
        array(
            "name" => "创意",
            "id" => "33818880",
        ) ,
        array(
            "name" => "多元智能",
            "id" => "33819136",
        ) ,
        array(
            "name" => "手工",
            "id" => "33819648",
        ) ,
        array(
            "name" => "其他",
            "id" => "33819904",
        ) ,
    ) ,
    "33882112" => array(
        array(
            "name" => "择校",
            "id" => "33882368",
        ) ,
        array(
            "name" => "咨询",
            "id" => "33882624",
        ) ,
        array(
            "name" => "简历",
            "id" => "33882880",
        ) ,
        array(
            "name" => "面试",
            "id" => "33883136",
        ) ,
        array(
            "name" => "语言",
            "id" => "33883392",
        ) ,
        array(
            "name" => "数学",
            "id" => "33883648",
        ) ,
        array(
            "name" => "英语",
            "id" => "33883904",
        ) ,
        array(
            "name" => "艺术",
            "id" => "33884160",
        ) ,
        array(
            "name" => "科学",
            "id" => "33884416",
        ) ,
        array(
            "name" => "社会教育",
            "id" => "33884672",
        ) ,
        array(
            "name" => "健康",
            "id" => "33884928",
        ) ,
        array(
            "name" => "体育",
            "id" => "33885184",
        ) ,
        array(
            "name" => "创意",
            "id" => "33885440",
        ) ,
        array(
            "name" => "多元智能",
            "id" => "33819136",
        ) ,
        array(
            "name" => "手工",
            "id" => "33885696",
        ) ,
        array(
            "name" => "习惯养成",
            "id" => "33885952",
        ) ,
        array(
            "name" => "纪律养成",
            "id" => "33886208",
        ) ,
        array(
            "name" => "其他",
            "id" => "33886464",
        ) ,
    ) ,
    "50397184" => array(
        array(
            "name" => "语文",
            "id" => "50397440",
        ) ,
        array(
            "name" => "数学",
            "id" => "50397696",
        ) ,
        array(
            "name" => "英语",
            "id" => "50397952",
        ) ,
        array(
            "name" => "其他",
            "id" => "50398208",
        ) ,
    ) ,
    "50462720" => array(
        array(
            "name" => "语文",
            "id" => "50462976",
        ) ,
        array(
            "name" => "数学",
            "id" => "50463232",
        ) ,
        array(
            "name" => "英语",
            "id" => "50463488",
        ) ,
        array(
            "name" => "其他",
            "id" => "50463744",
        ) ,
    ) ,
    "50528256" => array(
        array(
            "name" => "语文",
            "id" => "50528512",
        ) ,
        array(
            "name" => "数学",
            "id" => "50528768",
        ) ,
        array(
            "name" => "英语",
            "id" => "50529024",
        ) ,
        array(
            "name" => "其他",
            "id" => "50529280",
        ) ,
    ) ,
    "50593792" => array(
        array(
            "name" => "语文",
            "id" => "50594048",
        ) ,
        array(
            "name" => "数学",
            "id" => "50594304",
        ) ,
        array(
            "name" => "英语",
            "id" => "50594560",
        ) ,
        array(
            "name" => "其他",
            "id" => "50594816",
        ) ,
    ) ,
    "50659328" => array(
        array(
            "name" => "语文",
            "id" => "50659584",
        ) ,
        array(
            "name" => "数学",
            "id" => "50659840",
        ) ,
        array(
            "name" => "英语",
            "id" => "50660096",
        ) ,
        array(
            "name" => "其他",
            "id" => "50660352",
        ) ,
    ) ,
    "50724864" => array(
        array(
            "name" => "语文",
            "id" => "50725120",
        ) ,
        array(
            "name" => "数学",
            "id" => "50725376",
        ) ,
        array(
            "name" => "英语",
            "id" => "50725632",
        ) ,
        array(
            "name" => "其他",
            "id" => "50725888",
        ) ,
    ) ,
    "50790400" => array(
        array(
            "name" => "择校",
            "id" => "50790656",
        ) ,
        array(
            "name" => "政策分析",
            "id" => "50790912",
        ) ,
        array(
            "name" => "咨询",
            "id" => "50791168",
        ) ,
        array(
            "name" => "考试",
            "id" => "50791424",
        ) ,
        array(
            "name" => "简历",
            "id" => "50791680",
        ) ,
        array(
            "name" => "面试",
            "id" => "50791936",
        ) ,
        array(
            "name" => "语文",
            "id" => "50792192",
        ) ,
        array(
            "name" => "数学",
            "id" => "50792448",
        ) ,
        array(
            "name" => "英语",
            "id" => "50792704",
        ) ,
        array(
            "name" => "特长",
            "id" => "50792960",
        ) ,
        array(
            "name" => "其他",
            "id" => "50793216",
        ) ,
    ) ,
    "67174400" => array(
        array(
            "name" => "语文",
            "id" => "67174656",
        ) ,
        array(
            "name" => "数学",
            "id" => "67174912",
        ) ,
        array(
            "name" => "英语",
            "id" => "67175168",
        ) ,
        array(
            "name" => "历史",
            "id" => "67175424",
        ) ,
        array(
            "name" => "地理",
            "id" => "67175680",
        ) ,
        array(
            "name" => "政治",
            "id" => "67176192",
        ) ,
        array(
            "name" => "物理",
            "id" => "67176448",
        ) ,
        array(
            "name" => "化学",
            "id" => "67176704",
        ) ,
        array(
            "name" => "生物",
            "id" => "67175936",
        ) ,
        array(
            "name" => "其他",
            "id" => "67176960",
        ) ,
    ) ,
    "67239936" => array(
        array(
            "name" => "语文",
            "id" => "67240192",
        ) ,
        array(
            "name" => "数学",
            "id" => "67240448",
        ) ,
        array(
            "name" => "英语",
            "id" => "67240704",
        ) ,
        array(
            "name" => "历史",
            "id" => "67240960",
        ) ,
        array(
            "name" => "地理",
            "id" => "67241216",
        ) ,
        array(
            "name" => "政治",
            "id" => "67241984",
        ) ,
        array(
            "name" => "物理",
            "id" => "67241728",
        ) ,
        array(
            "name" => "化学",
            "id" => "67242240",
        ) ,
        array(
            "name" => "生物",
            "id" => "67241472",
        ) ,
        array(
            "name" => "其他",
            "id" => "67242496",
        ) ,
    ) ,
    "67305472" => array(
        array(
            "name" => "语文",
            "id" => "67305728",
        ) ,
        array(
            "name" => "数学",
            "id" => "67305984",
        ) ,
        array(
            "name" => "英语",
            "id" => "67306240",
        ) ,
        array(
            "name" => "历史",
            "id" => "67306496",
        ) ,
        array(
            "name" => "政治",
            "id" => "67307264",
        ) ,
        array(
            "name" => "物理",
            "id" => "67306752",
        ) ,
        array(
            "name" => "化学",
            "id" => "67307008",
        ) ,
        array(
            "name" => "其他",
            "id" => "67307520",
        ) ,
    ) ,
    "67371008" => array(
        array(
            "name" => "择校",
            "id" => "67371264",
        ) ,
        array(
            "name" => "政策分析",
            "id" => "67371520",
        ) ,
        array(
            "name" => "咨询",
            "id" => "67371776",
        ) ,
        array(
            "name" => "志愿填报",
            "id" => "67372032",
        ) ,
        array(
            "name" => "考试分析",
            "id" => "67372288",
        ) ,
        array(
            "name" => "语文",
            "id" => "67372544",
        ) ,
        array(
            "name" => "语文",
            "id" => "67372544",
        ) ,
        array(
            "name" => "数学",
            "id" => "67372800",
        ) ,
        array(
            "name" => "英语",
            "id" => "67373056",
        ) ,
        array(
            "name" => "历史",
            "id" => "67373312",
        ) ,
        array(
            "name" => "物理",
            "id" => "67373568",
        ) ,
        array(
            "name" => "化学",
            "id" => "67373824",
        ) ,
        array(
            "name" => "体能测试",
            "id" => "67374080",
        ) ,
        array(
            "name" => "其他",
            "id" => "67374336",
        ) ,
    ) ,
    "83951616" => array(
        array(
            "name" => "语文",
            "id" => "83951872",
        ) ,
        array(
            "name" => "数学",
            "id" => "83952128",
        ) ,
        array(
            "name" => "英语",
            "id" => "83952384",
        ) ,
        array(
            "name" => "历史",
            "id" => "83952896",
        ) ,
        array(
            "name" => "地理",
            "id" => "83952640",
        ) ,
        array(
            "name" => "政治",
            "id" => "83953152",
        ) ,
        array(
            "name" => "物理",
            "id" => "83953408",
        ) ,
        array(
            "name" => "化学",
            "id" => "83953664",
        ) ,
        array(
            "name" => "其他",
            "id" => "83953920",
        ) ,
    ) ,
    "84017152" => array(
        array(
            "name" => "语文",
            "id" => "84017408",
        ) ,
        array(
            "name" => "数学",
            "id" => "84017664",
        ) ,
        array(
            "name" => "英语",
            "id" => "84017920",
        ) ,
        array(
            "name" => "历史",
            "id" => "84018432",
        ) ,
        array(
            "name" => "地理",
            "id" => "84018176",
        ) ,
        array(
            "name" => "政治",
            "id" => "84018688",
        ) ,
        array(
            "name" => "其他",
            "id" => "83953920",
        ) ,
    ) ,
    "84082688" => array(
        array(
            "name" => "语文",
            "id" => "84082944",
        ) ,
        array(
            "name" => "数学",
            "id" => "84083200",
        ) ,
        array(
            "name" => "英语",
            "id" => "84083456",
        ) ,
        array(
            "name" => "物理",
            "id" => "84083712",
        ) ,
        array(
            "name" => "化学",
            "id" => "84083968",
        ) ,
        array(
            "name" => "生物",
            "id" => "84084224",
        ) ,
        array(
            "name" => "其他",
            "id" => "84084480",
        ) ,
    ) ,
    "84148224" => array(
        array(
            "name" => "语文",
            "id" => "84148480",
        ) ,
        array(
            "name" => "数学",
            "id" => "84148736",
        ) ,
        array(
            "name" => "英语",
            "id" => "84148992",
        ) ,
        array(
            "name" => "历史",
            "id" => "84149504",
        ) ,
        array(
            "name" => "地理",
            "id" => "84149248",
        ) ,
        array(
            "name" => "政治",
            "id" => "84149760",
        ) ,
        array(
            "name" => "其他",
            "id" => "84150016",
        ) ,
    ) ,
    "84213760" => array(
        array(
            "name" => "语文",
            "id" => "84214016",
        ) ,
        array(
            "name" => "数学",
            "id" => "84214272",
        ) ,
        array(
            "name" => "英语",
            "id" => "84214528",
        ) ,
        array(
            "name" => "物理",
            "id" => "84214784",
        ) ,
        array(
            "name" => "化学",
            "id" => "84215040",
        ) ,
        array(
            "name" => "生物",
            "id" => "84215296",
        ) ,
        array(
            "name" => "其他",
            "id" => "84215552",
        ) ,
    ) ,
    "84279296" => array(
        array(
            "name" => "政策分析",
            "id" => "84279552",
        ) ,
        array(
            "name" => "志愿填报",
            "id" => "84279808",
        ) ,
        array(
            "name" => "择校",
            "id" => "84280064",
        ) ,
        array(
            "name" => "考试分析",
            "id" => "84280832",
        ) ,
        array(
            "name" => "语文",
            "id" => "84281088",
        ) ,
        array(
            "name" => "数学",
            "id" => "84281344",
        ) ,
        array(
            "name" => "英语",
            "id" => "84281600",
        ) ,
        array(
            "name" => "历史",
            "id" => "84282112",
        ) ,
        array(
            "name" => "地理",
            "id" => "84281856",
        ) ,
        array(
            "name" => "政治",
            "id" => "84282368",
        ) ,
        array(
            "name" => "物理",
            "id" => "84282624",
        ) ,
        array(
            "name" => "化学",
            "id" => "84282880",
        ) ,
        array(
            "name" => "生物",
            "id" => "84283136",
        ) ,
        array(
            "name" => "特长",
            "id" => "84283392",
        ) ,
        array(
            "name" => "其他",
            "id" => "84283648",
        ) ,
    ) ,
    "100728832" => array(
        array(
            "name" => "其他",
            "id" => "100733952",
        ) ,
    ) ,
    "100794368" => array(
        array(
            "name" => "其他",
            "id" => "100799488",
        ) ,
    ) ,
    "151060480" => array(
        array(
            "name" => "声乐",
            "id" => "151060736",
        ) ,
        array(
            "name" => "器乐",
            "id" => "151060992",
        ) ,
        array(
            "name" => "合唱指挥",
            "id" => "151061248",
        ) ,
        array(
            "name" => "作曲",
            "id" => "151061504",
        ) ,
        array(
            "name" => "音乐理论",
            "id" => "151061760",
        ) ,
        array(
            "name" => "基本素质",
            "id" => "151062016",
        ) ,
        array(
            "name" => "音乐表演",
            "id" => "151062272",
        ) ,
        array(
            "name" => "音乐艺术管理",
            "id" => "151062784",
        ) ,
        array(
            "name" => "其他",
            "id" => "151063040",
        ) ,
    ) ,
    "151126016" => array(
        array(
            "name" => "民族舞",
            "id" => "151126272",
        ) ,
        array(
            "name" => "古典舞",
            "id" => "151126528",
        ) ,
        array(
            "name" => "现代舞",
            "id" => "151126784",
        ) ,
        array(
            "name" => "街舞",
            "id" => "151127296",
        ) ,
        array(
            "name" => "爵士舞",
            "id" => "151127552",
        ) ,
        array(
            "name" => "芭蕾舞",
            "id" => "151127808",
        ) ,
        array(
            "name" => "时尚舞",
            "id" => "151128064",
        ) ,
        array(
            "name" => "民间舞",
            "id" => "151128320",
        ) ,
        array(
            "name" => "肚皮舞",
            "id" => "151128576",
        ) ,
        array(
            "name" => "国际舞",
            "id" => "151128832",
        ) ,
        array(
            "name" => "迪斯科",
            "id" => "151129088",
        ) ,
        array(
            "name" => "韩舞",
            "id" => "151129344",
        ) ,
        array(
            "name" => "锐舞",
            "id" => "151129600",
        ) ,
        array(
            "name" => "钢管舞",
            "id" => "151129856",
        ) ,
        array(
            "name" => "啦啦队舞",
            "id" => "151130112",
        ) ,
        array(
            "name" => "其他",
            "id" => "151130368",
        ) ,
    ) ,
    "151191552" => array(
        array(
            "name" => "木雕",
            "id" => "151191808",
        ) ,
        array(
            "name" => "石雕",
            "id" => "151192064",
        ) ,
        array(
            "name" => "玉雕",
            "id" => "151192320",
        ) ,
        array(
            "name" => "沙雕",
            "id" => "151192832",
        ) ,
        array(
            "name" => "漆雕",
            "id" => "151193344",
        ) ,
        array(
            "name" => "皮雕",
            "id" => "151193856",
        ) ,
        array(
            "name" => "根雕",
            "id" => "151194112",
        ) ,
        array(
            "name" => "冰雕",
            "id" => "151194368",
        ) ,
        array(
            "name" => "泥塑",
            "id" => "151194624",
        ) ,
        array(
            "name" => "面塑",
            "id" => "151194880",
        ) ,
        array(
            "name" => "陶艺",
            "id" => "151195136",
        ) ,
        array(
            "name" => "石膏像",
            "id" => "151195648",
        ) ,
        array(
            "name" => "其他",
            "id" => "151195904",
        ) ,
    ) ,
    "151257088" => array(
        array(
            "name" => "油画",
            "id" => "151257344",
        ) ,
        array(
            "name" => "漆画",
            "id" => "151257856",
        ) ,
        array(
            "name" => "版画",
            "id" => "151258112",
        ) ,
        array(
            "name" => "插画",
            "id" => "151258624",
        ) ,
        array(
            "name" => "沙画",
            "id" => "151259392",
        ) ,
        array(
            "name" => "国画",
            "id" => "151260416",
        ) ,
        array(
            "name" => "漫画",
            "id" => "151261440",
        ) ,
        array(
            "name" => "水彩画",
            "id" => "151257600",
        ) ,
        array(
            "name" => "素描画",
            "id" => "151258368",
        ) ,
        array(
            "name" => "立体画",
            "id" => "151259136",
        ) ,
        array(
            "name" => "蛋彩画",
            "id" => "151260160",
        ) ,
        array(
            "name" => "卡通画",
            "id" => "151260672",
        ) ,
        array(
            "name" => "水粉画",
            "id" => "151260928",
        ) ,
        array(
            "name" => "简笔画",
            "id" => "151261184",
        ) ,
        array(
            "name" => "唐卡",
            "id" => "151259648",
        ) ,
        array(
            "name" => "速写",
            "id" => "151259904",
        ) ,
        array(
            "name" => "创意绘画",
            "id" => "151261696",
        ) ,
        array(
            "name" => "综合材料",
            "id" => "151258880",
        ) ,
        array(
            "name" => "其他",
            "id" => "151261952",
        ) ,
    ) ,
    "151322624" => array(
        array(
            "name" => "硬笔书法",
            "id" => "151322880",
        ) ,
        array(
            "name" => "篆刻",
            "id" => "151323136",
        ) ,
        array(
            "name" => "软笔书法",
            "id" => "151323648",
        ) ,
        array(
            "name" => "其他",
            "id" => "151323904",
        ) ,
    ) ,
    "151388160" => array(
        array(
            "name" => "其他",
            "id" => "151388416",
        ) ,
    ) ,
    "151453696" => array(
        array(
            "name" => "其他",
            "id" => "151453952",
        ) ,
    ) ,
    "168230912" => array(
        array(
            "name" => "其他",
            "id" => "168231168",
        ) ,
    ) ,
    "184811520" => array(
        array(
            "name" => "其他",
            "id" => "184811776",
        ) ,
    ) ,
    "201392128" => array(
        array(
            "name" => "其他",
            "id" => "201392384",
        ) ,
    ) ,
);


if (!isset($_POST['id'])) {
    $level = 1;
    $list = $category1;
}
else {
    $id = $_POST['id'];
    echo $id;
    if (isset($category2[$id])) {
        $level = 2;
        $list = $category2[$id];
    }
    else if (isset($category3[$id])) {
        $level = 3;
        $list = $category3[$id];
    }
}

$response = array(
    "code" => 0,
    "data" => array(
        "level" => $level,
        "children" => $list
    )
);

echo json_encode($response);