{{extends file="page/_base/base.tpl"}}

{{block name="page"}}
    {{$page_title = "扣分规则"}}

    {{$enable_backTopButton = false}}
{{/block}}

{{block name="data"}}{{/block}}

{{block name="style"}}
    <link rel="stylesheet" href="{{$static_origin}}/src/page/teacher/deduct/rule/index.styl"/>
{{/block}}

{{block name="content"}}

    <div class="rule-content">
        <div>
            亲爱的老师：
        </div>

        <p>
            跟谁学创立以来，受到众多老师的支持与厚爱，老师们在平台上招生授课，学生们在平台上找到好老师，师生之间其乐融融。然而，极少数老师的一些违规行为，对学生以及其他老师的权益造成了伤害，也破坏了平台的口碑。为了保障老师和学生们的合法权益，维护跟谁学平台的正常运营秩序，跟谁学平台正式实施违规行为扣分处罚措施。
        </p>
        <p style="text-indent: 0;">扣分项包括但不限于以下行为：</p>

        <p style="text-indent: 0;">一、课堂规则</p>

        <ul>
            <li>1. 线上直播课程迟到，每次扣1分。</li>
            <li>2. 线上直播课程旷课，每次扣3分。</li>
        </ul>

        <ul>
            <li>注：</li>
            <li>线上直播课迟到：课程开课后5分钟未进入教室。</li>
            <li>线上直播课程旷课：直播课开课期间老师未进入教室，学生进入教室。</li>
        </ul>


        <p style="text-indent: 0;">二、恶意骚扰</p>

        <p style="text-indent: 0;">老师用户在跟谁学平台课程评价、IM群聊、直播教室聊天区等区域对其他老师用户实施侮辱、诽谤的行为。</p>

        <ul>
        <li>1. 平台实行“谁发起谁举证”的原则， 举证材料包括但不限于：</li>
            <li>① 完整清晰的聊天历史记录截图（评价、群聊、短信等）</li>
            <li>② 电话通话记录详情单</li>
            <li>③ 其他可以证实被投诉方存在恶意评价行为的凭证。</li>
        </ul>

        <ul>
            <li>2. 一经平台核实裁定，平台将对“恶意骚扰”一方进行扣分处理，第一次恶意骚扰扣6分，第二次扣12分，第三次扣36分。</li>
        </ul>

        <p style="text-indent: 0;">三、虚假交易</p>

        <p>虚假交易，每次扣2分。</p>

        <p style="text-indent: 0;">四、频繁修改班课时间</p>

        <p>班课有学生报名后，按照班课总课节数除以15，取结果整数部分，乘2，所得结果为可修改班课时间的次数（最少有2次修改机会）。超过这个次数每次修改会被扣2分。修改课节内容、课程时长或添加新课节不扣分。</p>
        <p style="text-indent: 0;">五、其他被跟谁学平台认定为影响平台正常运营秩序的行为，依照具体情况酌情扣分。</p>

        <ul>
            <p style="text-indent: 0;">惩罚措施：</p>

            <li style="text-indent: 0;">一、老师被扣分，将影响老师本人以及所开课程的搜索排序，具体影响程度视扣分的多少而定。</li>

            <li style="text-indent: 0;">二、90天内，对扣分达到12分的老师，老师主页及所有课程搜索屏蔽90天。</li>

            <li style="text-indent: 0;">三、一个自然年内扣分达到36分，老师主页及所有课程无限期搜索屏蔽，会员费不退。</li>
        </ul>


        <p>本规则适用于所有入驻跟谁学平台的老师，本规则相关解释权属于跟谁学平台。</p>

        <p>我们深信，健康诚信的环境是平台发展的基础，更是平台上老师和学生权益的保障。</p>

        <p>我们也坚信，所有支持跟谁学的老师们，会和我们一起，共同打造更加美好的学习服务平台！</p>


    </div>

{{/block}}
